package com.company;

/*Конструктори і методи обов’язково мають перевіряти параметри на допустимість; у
        разі неправильних даних – виводити повідомлення про помилку і завершувати роботу.
        У всіх завданнях реалізувати функцію, що одержує і повертає об’єкти базового класу.
        Продемонструвати принцип підстановки.
        Для демонстрації роботи з об’єктами нового типу у всіх завданнях потрібно написати
        головну функцію. У програмі мають бути реалізовані різні способи створення об’єктів і
        масивів об’єктів. Програма має демонструвати використання всіх функцій та методів.
        Варіант 5.
        Створити клас автомобіль, який має марку (вказівник на рядок), колір, об’єм
        двигуна, потужність. Визначити конструктори, деструктор і функцію виведення. Створити
        public-похідний клас – вантажівка, що має вантажопідйомність кузова. Визначити
        конструктори за умовчанням і з різним числом параметрів, деструктор, функцію виведення.
        Визначити функції перепризначення марки і вантажопідйомності.*/

public class Main {

    public static void main(String[] args) {

    Car car1 = new Car("Toyota", "green", 6.0, 45.0);
    car1.setBrand(car1);
        System.out.println(car1.toString());
    Van van1 = new Van("Volkswagen", "white", 12.0, 80.0, 1000);
    van1.setCargoCapacity();
        System.out.println(van1.toString());
    System.gc();

    }

}
